Repository: Rwagsu/BadMC_Launcher
Catalog: BadMC_Launcher/Strings/*/ViewResources.resw
Source language: en_us
Languages: zh_hans

# Global_BetaTipResource.ToolTipService.ToolTip
source: This feature is currently in beta status and may be changed or removed at any time.
zh_hans: 该功能目前为测试状态，随时可能更改或删除.

# JavaContentDialog_AddJavaButton.Text
source: Add the Java Runtime from local
zh_hans: 从本地添加 Java 运行时

# JavaContentDialog_AutoJavaButton.Text
source: Automatically Setting Java
zh_hans: 自动设置 Java

# JavaContentDialog_DeleteJavaMenuFlyoutItem.Text
source: Delete (Does not affect local Java Runtime)
zh_hans: 删除 (不影响本地 Java 运行时)

# JavaContentDialog_DownloadJavaButton.ToolTipService.ToolTip
source: Download new Java Runtime from the web
zh_hans: 从网络下载新的 Java 运行时 暂未实现(嘿嘿🤤)

# JavaContentDialog_JavaListEmptyTipsHyperLinkButton.Content
source: Search the Java Runtime from local
zh_hans: 在本地搜索 Java 运行时

# JavaContentDialog_JavaListEmptyTipsTextBlock.Text
source: Can't find any Java Runtimes
zh_hans: 找不到任何 Java 运行时

# JavaContentDialog_JavaListLoadingTipsLoadingAnimation.LoadDescription
source: Getting Java Runtime......
zh_hans: 正在获取 Java 运行时......

# JavaContentDialog_LocalViewMenuFlyoutItem.Text
source: View in File Manager
zh_hans: 在文件管理器中显示

# JavaContentDialog_SearchJavaButton.ToolTipService.ToolTip
source: Search the Java Runtime from local
zh_hans: 在本地搜索 Java 运行时

# JavaContentDialog_ViewContentDialog.PrimaryButtonText
source: OK
zh_hans: 确定

# JavaContentDialog_ViewContentDialog.Title
source: Manage Java Runtimes
zh_hans: 管理 Java 运行时

# JvmArgumentsContentDialog_JvmArgmentsEmptyTipsMessageTextBlock.Text
source: But that might be a good thing 🫠
zh_hans: 但这没准是件好事 🫠

# JvmArgumentsContentDialog_JvmArgmentsEmptyTipsTitleTextBlock.Text
source: The Jvm parameter is empty.
zh_hans: Jvm 参数是空的.

# JvmArgumentsContentDialog_JvmJvmArgumentsTokenizingTextBox.PlaceholderText
source: Add a parameter (Hit Enter to confirm)
zh_hans: 添加参数(需要使用 + 或 Enter 应用)

# JvmArgumentsContentDialog_ViewContentDialog.PrimaryButtonText
source: OK
zh_hans: 确定

# JvmArgumentsContentDialog_ViewContentDialog.Title
source: Change Jvm parameters (advanced)
zh_hans: 更改 Jvm 参数(高级)

# LaunchPad_LaunchButtonNameResource.Text
source: Launch Minecraft!
zh_hans: 启动 Minecraft!

# LaunchPad_MinecraftEmptyListTipsHyperLinkButton.Text
source: Go to the versions page to manage Minecraft ontologies folders.
zh_hans: 转到本体页面以管理 Minecraft 版本文件夹.

# LaunchPad_MinecraftEmptyListTipsTextBlock.Text
source: Can't find any Minecraft versions :(
zh_hans: 找不到任何 Minecraft 版本 :(

# LaunchPad_MinecraftEntryListRefreshMenuFlyoutItem.Text
source: Refresh
zh_hans: 刷新

# LaunchPad_MinecraftEntryListsManagerMenuFlyoutItem.Text
source: Manage Minecraft versions folders
zh_hans: 管理 Minecraft 版本文件夹

# LaunchPad_MinecraftFolderComboBox.PlaceholderText
source: Minecraft versions folder not selected (´-ω-`)
zh_hans: 未选择 Minecraft 版本文件夹 (´-ω-`)

# LaunchPad_ViewLocalMinecraftFolderMenuFlyoutItem.Text
source: Browse Minecraft version folder
zh_hans: 浏览 Minecraft 版本文件夹

# LaunchSettingsPage_AdvancedSettingWarningInfoBar.Message
source: This setting lets you tweak things normal settings can’t reach, but we don’t recommend messing with JVM arguments unless you know what you’re doing. If you think you’ve messed up or the game won’t start because of these settings, just clear all values to reset.
zh_hans: 这个设置可以修改很多普通设置无法达到的东西，但我们不建议不了解 JVM参数的人修改这些. 如果你认为你搞砸了或者游戏因为这些设置无法启动，请清除所有值.

# LaunchSettingsPage_AdvancedSettingWarningInfoBar.Title
source: Advanced setting warning
zh_hans: 高级设置警告

# LaunchSettingsPage_FullJvmArgumentsTextSettingsCard.Description
source: Not recommend unless you need to paste a whole block of parameters.
zh_hans: 除非需要粘贴整块参数, 否则不推荐.

# LaunchSettingsPage_FullJvmArgumentsTextSettingsCard.Header
source: Directly change the Jvm startup parameters
zh_hans: 直接更改 Jvm 启动参数

# LaunchSettingsPage_GameMemorySizeSettingsExpander.Description
source: Set the memory used when running Minecraft Java.
zh_hans: 设置运行 Minecraft Java 时所使用的内存.

# LaunchSettingsPage_GameMemorySizeSettingsExpander.Header
source: Minecraft memory usage
zh_hans: Minecraft 使用内存

# LaunchSettingsPage_GameMemoryViewTextBlock.Text
source: Minecraft usage
zh_hans: Minecraft 最大已分配

# LaunchSettingsPage_JavaPathSettingsCard.Description
source: Setting the Java Runtime for Minecraft Java.
zh_hans: 为 Minecraft Java 设置 Java 运行时.

# LaunchSettingsPage_JavaPathSettingsCard.Header
source: Set Java runtime
zh_hans: 设置 Java 运行时

# LaunchSettingsPage_JvmArgumentsSettingsCard.Description
source: The custom parameters for all activities are here, if they cannot be run, please delete them.
zh_hans: 所有活动的自定义参数都在这里，如果无法运行，请删除它们.

# LaunchSettingsPage_JvmArgumentsSettingsCard.Header
source: Jvm parameters
zh_hans: Jvm 参数

# LaunchSettingsPage_LauncherNameSettingsCard.Description
source: This info will show up at the bottom-right of the game’s splash screen and the top-left of the F3 debug menu.
zh_hans: 这些信息将显示在游戏封面的右下角和 F3 调试信息的左上角.

# LaunchSettingsPage_LauncherNameSettingsCard.Header
source: Custom Game Info
zh_hans: 自定义游戏信息

# LaunchSettingsPage_LaunchServerSettingsCard.Description
source: We don’t support managing launch servers on the settings page. 😟
zh_hans: 我们不支持在设置页面管理启动服务器. 😟

# LaunchSettingsPage_LaunchServerSettingsCard.Header
source: Head to Multiplayer to manage servers that launch with the game
zh_hans: 转到 多人游戏 以管理启动时服务器

# LaunchSettingsPage_MemorySizeIsAutoToggleSwitch.OffContent
source: Manual settings
zh_hans: 手动设置

# LaunchSettingsPage_MemorySizeIsAutoToggleSwitch.OnContent
source: Automatic distribution
zh_hans: 自动分配

# LaunchSettingsPage_MemoryViewSettingsCard.Text
source: Preview of memory usage
zh_hans: 内存预览

# LaunchSettingsPage_MinecraftFolderSettingsCard.Description
source: Management of versions and resource storage locations.
zh_hans: 对版本以及资源的存储位置进行管理.

# LaunchSettingsPage_MinecraftFolderSettingsCard.Header
source: Manage Minecraft versions folders
zh_hans: 管理 Minecraft 版本文件夹

# LaunchSettingsPage_OpenJvmArgumentsDialogButton.Text
source: Use list editing
zh_hans: 使用列表编辑

# LaunchSettingsPage_SetGameMemorySettingsCard.Header
source: Set Minecraft runtime memory manually
zh_hans: 手动设置 Minecraft 运行时内存

# LaunchSettingsPage_SetGameMinMemoryNumberBox.PlaceholderText
source: Min (MB)
zh_hans: 最小 (MB)

# LaunchSettingsPage_SetMaxGameMemoryNumberBox.PlaceholderText
source: Max (MB)
zh_hans: 最大 (MB)

# LaunchSettingsPage_SetMemoryFlyoutTitleTextBlock.Text
source: Set Minecraft min & max memory manually (MB)
zh_hans: 手动设置 Minecraft 最大 & 最小内存

# LaunchSettingsPage_TipsInfoBar.Message
source: This setting will have a lower priority than version-specific customizations. If something in this setting has been changed in an version-specific customization, that item will not take effect for this version.
zh_hans: 该设置的优先级将比特定于版本的自定义设置更低. 如果这个设置的某些项已在特定于版本的自定义设置中更改，该项将不会对这个版本生效.

# LaunchSettingsPage_TipsInfoBar.Title
source: Lower priority
zh_hans: 更低的优先级

# LaunchSettingsPage_UsedMemoryViewTextBlock.Text
source: Usage \ Available
zh_hans: 已使用 \ 可用

# LaunchSettingsPage_VersionIsolationSettingsCard.Description
source: Isolates Mods, Lights and Shadows of eligible Minecraft versions from other versions.
zh_hans: 将符合条件的 Minecraft 版本的 Mod, 光影等资源包与其它本体隔离.

# LaunchSettingsPage_VersionIsolationSettingsCard.Header
source: Version Isolation
zh_hans: 版本隔离

# LaunchSettingsPage_WindowSettingsExpander.Description
source: Full screen window when starting the game . (Window size is determined by the window size setting after closing)
zh_hans: 启动游戏时全屏窗口. (关闭后由窗口大小设置决定窗口大小)

# LaunchSettingsPage_WindowSettingsExpander.Header
source: Full screen when launching the game
zh_hans: 启动游戏时全屏

# LaunchSettingsPage_WindowSizeSettingsCard.Description
source: Change the window size when the game is first started. (The setting does not work in full screen)
zh_hans: 更改游戏在刚启动时窗口大小. (全屏时设置不生效)

# LaunchSettingsPage_WindowSizeSettingsCard.Header
source: Change the initial window size of the game (Width x Height)
zh_hans: 更改游戏初始窗口大小 (宽度 x 高度)

# MainPage_MainSideBarNavigationView.PaneTitle
source: Let's BadMC Launcher！ 🥳😝😈
zh_hans: 让我们一起 BadMC Launcher！ 🥳😝😈

# MainPage_SearchFilterTagsResource.Text
source: Filter search results
zh_hans: 筛选搜索结果

# MainPage_SearchResource.PlaceholderText
source: Try searching for what? ψ(｀∇´)ψ
zh_hans: 搜点什么？ψ(｀∇´)ψ

# MinecraftFolderContentDialog_AddMinecraftFolder_Button.Text
source: Adding a new Minecraft versions folder
zh_hans: 添加新的 Minecraft 版本文件夹

# MinecraftFolderContentDialog_DeleteMinecraftFolderMenuFlyoutItem.Text
source: Delete (Does not affect local folder)
zh_hans: 删除 (不影响本地文件夹)

# MinecraftFolderContentDialog_LocalViewMenuFlyoutItem.Text
source: View in File Manager
zh_hans: 在文件管理器中显示

source: Add a Minecraft versions folder from local
zh_hans: 从本地添加 Minecraft 版本文件夹

# MinecraftFolderContentDialog_MinecraftFolderListEmptyTips_TextBlock.Text
source: Can't find any Minecraft versions folder :(
zh_hans: 找不到任何 Minecraft 版本文件夹 :(

# MinecraftFolderContentDialog_MinecraftFolderRenameApply_Button.Content
source: Apply
zh_hans: 应用

# MinecraftFolderContentDialog_MinecraftFolderRenameCancel_Button.Content
source: Cancel
zh_hans: 取消

# MinecraftFolderContentDialog_MinecraftFolderRenameError_TextBlock.Text
source: The name must not be empty or duplicated.
zh_hans: 名称不可为空或与其它项重名.

source: etc! Renaming will be turned off when clicked! (Flyout is too hard so I can't fix it QAQ)
zh_hans: 等等！点击时将会关闭重命名！（Flyout太难了修不了 QAQ）

# MinecraftFolderContentDialog_MinecraftFolderRenamePath_TextBlock.Text
source: Path
zh_hans: 路径

# MinecraftFolderContentDialog_MinecraftFolderRename_TextBlock.Text
source: Rename (Does not affect local folder)
zh_hans: 重命名 (不影响本地文件夹)

# MinecraftFolderContentDialog_RenameMinecraftFolderMenuFlyoutItem.Text
source: Rename (Does not affect local folder)
zh_hans: 重命名 (不影响本地文件夹)

# MinecraftFolderContentDialog_ViewContentDialog.PrimaryButtonText
source: OK
zh_hans: 确定

# MinecraftFolderContentDialog_ViewContentDialog.Title
source: Manage Minecraft versions folders
zh_hans: 管理 Minecraft 版本文件夹

# SettingsDashboardPage_SideBar.PaneTitle
source: Settings
zh_hans: 设置

# ThemeSettingsPage_ColorThemeSettingsCard.Header
source: Color theme
zh_hans: 颜色主题

# ThemeSettingsPage_ColorThemeSettingsCard.Description
source: Set the color of the application display. (It is recommended to restart the application after making changes to prevent any possible color anomalies.)
zh_hans: 设置应用显示的颜色. (建议在修改后重启应用以防止任何可能的颜色异常.)

# ThemeSettingsPage_ColorThemes_System.Content
source: Follow system
zh_hans: 跟随系统

# ThemeSettingsPage_ColorThemes_Light.Content
source: Light
zh_hans: 浅色

# ThemeSettingsPage_ColorThemes_Dark.Content
source: Dark
zh_hans: 深色

# ThemeSettingsPage_AccentColorSettings_Expander.Header
source: Application accent colors
zh_hans: 应用强调色

# ThemeSettingsPage_AccentColorSettings_Expander.Description
source: Sets the control's accent color.
zh_hans: 设置控件的强调色.

# ThemeSettingsPage_AccentColorMode_SettingsCard.Header
source: Set theme color
zh_hans: 设置主题色

# ThemeSettingsPage_AccentColorMode_SettingsCard.Description
source: Set the theme color and accent color for the app.
zh_hans: 设置应用的主题色和强调色.

# ThemeSettingsPage_AccentColorThemes_System.Text
source: Follow system
zh_hans: 跟随系统

# ThemeSettingsPage_AccentColorThemes_Custom.Text
source: Custom colors
zh_hans: 自定义颜色

# ThemeSettingsPage_AccentColorThemes_ImageMonet.Text
source: Use Monet (from image)
zh_hans: 使用 Monet (从图片获取)

# ThemeSettingsPage_AccentColorThemes_ColorMonet.Text
source: Use Monet (get from color)
zh_hans: 使用 Monet (从颜色获取)

# ThemeSettingsPage_AccentColorThemes_Custom.ToolTipService.ToolTip
source: Use custom colors as your accent colors.
zh_hans: 使用自定义颜色当作你的强调色.

# ThemeSettingsPage_AccentColorThemes_SystemTips.ToolTipService.ToolTip
source: Highlight color follow system. (Some systems may not work.)
zh_hans: 强调色跟随系统. (有些系统可能不生效.)

# ThemeSettingsPage_AccentColorThemes_ImageMonetTips.ToolTipService.ToolTip
source: Use Monet to select a suitable color from the background image as an accent color and apply it to your theme. (This setting requires you to set a background image.)
zh_hans: 使用 Monet 从背景图片中选取一个合适的颜色当作强调色并将其应用到你的主题中. (该设置要求你必须设置背景图像.)

# ThemeSettingsPage_AccentColorThemes_ColorMonetTips.ToolTipService.ToolTip
source: Use Monet to calculate all suitable colors from a single color as accent colors and apply them to your theme.
zh_hans: 使用 Monet 从一个颜色中计算出所有合适的颜色当作强调色并将其应用到你的主题中.

# ThemeSettingsPage_SystemAccentColor_SettingsCard.Header
source: It's just a very cute little monster ヽ(*・ω・)ﾉ
zh_hans: 这只是一只非常可爱的小怪物 ヽ(*・ω・)ﾉ

# ThemeSettingsPage_SystemAccentColor_SettingsCard.Description
source: Oh, right, what are you looking for? (´･ω･`)?
zh_hans: 啊对了, 你在找什么? (´･ω･`)?

# ThemeSettingsPage_SolidColorAccentColor_SettingsCard.Header
source: Manually set accent color
zh_hans: 手动设置强调色

# ThemeSettingsPage_SolidColorAccentColor_SettingsCard.Description
source: Manually select the accent color for the application. (Takes effect after restarting.)
zh_hans: 通过手动选取颜色设置应用的强调色. (重启后生效)

# ThemeSettingsPage_ImageMonetAccentColor_SettingsCard.Header
source: Select from image background
zh_hans: 从图片背景中选择

# ThemeSettingsPage_ImageMonetAccentColor_SettingsCard.Description
source: Use Monet to select color from the background and change the entire theme system. This setting only takes effect when an image background is set.
zh_hans: 使用 Monet 从背景中选择颜色并更改整个主题系统, 该设置仅在设置了图片背景的情况下生效.

# ThemeSettingsPage_ColorMonetAccentColor_SettingsCard.Header
source: Manually select Monet theme color
zh_hans: 手动选取 Monet 主题色

# ThemeSettingsPage_ColorMonetAccentColor_SettingsCard.Description
source: Manually select a color and use Monet to generate theme colors.
zh_hans: 手动选取一个颜色并使用 Monet 生成主题色.

# ThemeSettingsPage_MonetPlan_SettingsCard.Header
source: Monet Solution
zh_hans: Monet 方案

# ThemeSettingsPage_MonetPlan_SettingsCard.Description
source: Select a Monet color scheme. (This may change your theme colors.)
zh_hans: 选择一个 Monet 颜色方案. (这可能会更改你的主题颜色.)

# ThemeSettingsPage_ImageMonetAccentColorSelectTitle_TextBlock.Text
source: Select a color.
zh_hans: 选择一个颜色.

# ThemeSettingsPage_ImageMonetAccentColorsEmptyTitle_TextBlock.Text
source: There are no colors here.
zh_hans: 这里没有颜色.

# ThemeSettingsPage_ImageMonetAccentColorsEmptySubTitle_TextBlock.Text
source: Did you forget to set the image background?
zh_hans: 是否忘记了设置图像背景?

# ThemeSettingsPage_BackgroundSettings_Expander.Header
source: Change launcher background
zh_hans: 更改启动器背景

# ThemeSettingsPage_BackgroundSettings_Expander.Description
source: Set the display scheme for the launcher background.
zh_hans: 设置启动器背景的显示方案.

# ColorPickerButton_Apply_Button.Content
source: Apply
zh_hans: 应用

# ColorPickerButton_Cancel_Button.Content
source: Cancel
zh_hans: 取消

# ThemeSettingsPage_BackgroundType_StaticImageTips.ToolTipService.ToolTip
source: Use static image as application background.
zh_hans: 使用静态图片作为应用背景.

# ThemeSettingsPage_BackgroundType_StaticImage.Text
source: Static image
zh_hans: 静态图片

# ThemeSettingsPage_BackgroundType_BingWallpaperTips.ToolTipService.ToolTip
source: Get daily Bing wallpapers from the Bing API and use them as launcher wallpapers (requires internet connection)
zh_hans: 从 Bing API 获取每日 Bing 壁纸并当作启动器壁纸 (需要网络连接)

# ThemeSettingsPage_BackgroundType_BingWallpaper.Text
source: Bing Daily Wallpaper
zh_hans: Bing 每日壁纸

# ThemeSettingsPage_BackgroundType_BingWallpaperWebTip.Text
source: Network required
zh_hans: 需要网络

# ThemeSettingsPage_BackgroundType_AcrylicTip.ToolTipService.ToolTip
source: Use Acrylic as your launcher background.
zh_hans: 使用 Acrylic (亚克力) 作为你的启动器背景.

# ThemeSettingsPage_BackgroundType_Acrylic.Text
source: Acrylic
zh_hans: Acrylic (亚克力)
